In [1]:
import numpy as np
import pandas as pd

In [2]:
dict = {
    "name":['Pratik','Rushi','Vikas','Yogita'],
    "Marks":[92,45,84,65],
    "City":['Nashik','Pune','Nagpur','Nashik']
}

In [3]:
df = pd.DataFrame(dict)

In [4]:
df

     name  Marks    City
0  Pratik     92  Nashik
1   Rushi     45    Pune
2   Vikas     84  Nagpur
3  Yogita     65  Nashik

In [6]:
# dataframe to csv
df.to_csv('student_data.csv',index=False)

In [7]:
#first rows
df.head(2)

     name  Marks    City
0  Pratik     92  Nashik
1   Rushi     45    Pune

In [9]:
#last rows
df.tail(2)

     name  Marks    City
2   Vikas     84  Nagpur
3  Yogita     65  Nashik

In [10]:
#statistical numerical data
df.describe()

           Marks
count   4.000000
mean   71.500000
std    20.984121
min    45.000000
25%    60.000000
50%    74.500000
75%    86.000000
max    92.000000

In [11]:

r_csv=pd.read_csv('practice.csv')

In [12]:
r_csv

     Name  Age          Occupation
0    John   25            Engineer
1   Alice   30             Teacher
2     Bob   22             Student
3     Eva   35              Doctor
4   Chris   28  Software Developer
5  Sophia   32   Marketing Analyst

In [13]:
r_csv['Name']

0      John
1     Alice
2       Bob
3       Eva
4     Chris
5    Sophia
Name: Name, dtype: object

In [14]:
r_csv['Name'][0]

'John'

In [15]:
r_csv['Age'][0]=26

C:\Users\dell\AppData\Local\Temp\ipykernel_10124\1229426570.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  r_csv['Age'][0]=26

In [16]:
r_csv

     Name  Age          Occupation
0    John   26            Engineer
1   Alice   30             Teacher
2     Bob   22             Student
3     Eva   35              Doctor
4   Chris   28  Software Developer
5  Sophia   32   Marketing Analyst